Revit 2026 API

# Document Class

---

The Document Creation object is used to create new instances of elements within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.CreationItemFactoryBase Autodesk.Revit.CreationDocument

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Document : ItemFactoryBase
```
```vb
Public Class Document
	Inherits ItemFactoryBase
```
```cpp
public ref class Document : public ItemFactoryBase
```
```fsharp
type Document =
    class
        inherit ItemFactoryBase
    end
```

The Document type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | NewAlignment | Add a new locked alignment into the Autodesk Revit document.(Inherited from ItemFactoryBase) |
|  | NewArea | Creates a new area |
|  | NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Area BoundaryConditions element on a host element. |
|  | NewAreaBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Area BoundaryConditions element on a reference. |
|  | NewAreaBoundaryLine | Creates a new boundary line as an Area border. |
|  | NewAreas |  |
|  | NewAreaTag | Creates a new area tag. |
|  | NewCrossFitting | Add a new family instance of a cross fitting into the Autodesk Revit document, using four connectors. |
|  | NewCurtainSystem | Creates a new CurtainSystem element from a set of faces. |
|  | NewCurtainSystem2 | Creates a new CurtainSystem element from a set of face references. |
|  | NewDetailCurve | Creates a new detail curve element. (Inherited from ItemFactoryBase) |
|  | NewDetailCurveArray | Creates an array of new detail curve elements. (Inherited from ItemFactoryBase) |
|  | NewDimension(View, Line, ReferenceArray) | Creates a new linear dimension object using the default dimension style.(Inherited from ItemFactoryBase) |
|  | NewDimension(View, Line, ReferenceArray, DimensionType) | Creates a new linear dimension object using the specified dimension style.(Inherited from ItemFactoryBase) |
|  | NewElbowFitting | Add a new family instance of an elbow fitting into the Autodesk Revit document, using two connectors. |
|  | NewExtrusionRoof | Creates a new Extrusion Roof. |
|  | NewFamilyInstance(Face, Line, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a line on that face for its position, and a type/symbol.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(Line, FamilySymbol, View) | Add a line based detail family instance into the Autodesk Revit document, using an line and a view where the instance should be placed.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(Reference, Line, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a line on that face for its position, and a type/symbol.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(XYZ, FamilySymbol, StructuralType) | Inserts a new instance of a family into the document, using a location and a type/symbol.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(XYZ, FamilySymbol, View) | Add a new family instance into the Autodesk Revit document, using an origin and a view where the instance should be placed.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(Curve, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a curve, type/symbol and reference level. |
|  | NewFamilyInstance(Face, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a location, reference direction, and a type/symbol.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(Reference, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a location, reference direction, and a type/symbol.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(XYZ, FamilySymbol, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, and the host element.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(XYZ, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, and the level.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstance(XYZ, FamilySymbol, Element, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a base level. |
|  | NewFamilyInstance(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a reference direction.(Inherited from ItemFactoryBase) |
|  | NewFamilyInstances2 | (Inherited from ItemFactoryBase) |
|  | NewFascia(FasciaType, Reference) | Creates a fascia along a reference. |
|  | NewFascia(FasciaType, ReferenceArray) | Creates a fascia along a reference array. |
|  | NewFlexDuct(IListXYZ, FlexDuctType) |  |
|  | NewFlexDuct(Connector, Connector, FlexDuctType) | Adds a new flexible duct into the document, using two connector, and duct type. |
|  | NewFlexDuct(Connector, IListXYZ, FlexDuctType) |  |
|  | NewFlexPipe(IListXYZ, FlexPipeType) |  |
|  | NewFlexPipe(Connector, Connector, FlexPipeType) | Adds a new flexible pipe into the document, using two connector, and flexible pipe type. |
|  | NewFlexPipe(Connector, IListXYZ, FlexPipeType) |  |
|  | NewFootPrintRoof | Creates a new FootPrintRoof element. |
|  | NewGroup | (Inherited from ItemFactoryBase) |
|  | NewGutter(GutterType, Reference) | Creates a gutter along a reference. |
|  | NewGutter(GutterType, ReferenceArray) | Creates a gutter along a reference array. |
|  | NewLineBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Line BoundaryConditions element on a host element. |
|  | NewLineBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Creates a new Line BoundaryConditions element on a reference. |
|  | NewMechanicalSystem | Creates a new MEP mechanical system element. |
|  | NewModelCurve | Creates a new model line element. (Inherited from ItemFactoryBase) |
|  | NewModelCurveArray | Creates an array of new model line elements. (Inherited from ItemFactoryBase) |
|  | NewOpening(Element, CurveArray, eRefFace) | Creates a new opening in a beam, brace and column. |
|  | NewOpening(Element, CurveArray, Boolean) | Creates a new opening in a roof, floor and ceiling. |
|  | NewOpening(Level, Level, CurveArray) | Creates a new shaft opening between a set of levels. |
|  | NewOpening(Wall, XYZ, XYZ) | Creates a rectangular opening on a wall. |
|  | NewPipingSystem | Creates a new MEP piping system element. |
|  | NewPointBoundaryConditions | Creates a new Point BoundaryConditions Element. |
|  | NewReferencePlane | Creates a new instance of ReferencePlane. (Inherited from ItemFactoryBase) |
|  | NewReferencePlane2 | Creates a new instance of ReferencePlane. (Inherited from ItemFactoryBase) |
|  | NewRoom(Phase) | Creates a new unplaced room and with an assigned phase. |
|  | NewRoom(Level, UV) | Creates a new room on a level at a specified point. |
|  | NewRoom(Room, PlanCircuit) | Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit. |
|  | NewRoomBoundaryLines | Creates a new boundary line as an Room border. |
|  | NewRooms2(Level) | Creates new rooms in each plan circuit found in the given level in the last phase. |
|  | NewRooms2(Level, Phase) | Creates new rooms in each plan circuit found in the given level in the given phase. |
|  | NewRooms2(Phase, Int32) | Creates new unplaced rooms in the given phase. |
|  | NewRoomTag | Creates a new RoomTag referencing a room in the host model or in a Revit link. |
|  | NewSlabEdge(SlabEdgeType, Reference) | Creates a slab edge along a reference. |
|  | NewSlabEdge(SlabEdgeType, ReferenceArray) | Creates a slab edge along a reference array. |
|  | NewSpace(Phase) | Creates a new unplaced space on a given phase. |
|  | NewSpace(Level, UV) | Creates a new space element on the given level at the given location. |
|  | NewSpace(Level, Phase, UV) | Creates a new space element on the given level, at the given location, and assigned to the given phase. |
|  | NewSpaceBoundaryLines | Creates a new boundary line as an Space border. |
|  | NewSpaces2(Phase, Int32) | Creates a set of new unplaced spaces on a given phase. |
|  | NewSpaces2(Level, Phase, View) | Creates new spaces on the available plan circuits of a the given level. |
|  | NewSpaceTag | Creates a new SpaceTag. |
|  | NewSpotCoordinate | Generate a new spot coordinate object within the project. |
|  | NewSpotElevation | Generate a new spot elevation object within the project. |
|  | NewTakeoffFitting | Add a new family instance of an takeoff fitting into the Autodesk Revit document, using one connector and one MEP curve. |
|  | NewTeeFitting | Add a new family instance of a tee fitting into the Autodesk Revit document, using three connectors. |
|  | NewTransitionFitting | Add a new family instance of an transition fitting into the Autodesk Revit document, using two connectors. |
|  | NewUnionFitting | Add a new family instance of an union fitting into the Autodesk Revit document, using two connectors. |
|  | NewZone | **Obsolete.** Creates a new Zone element. |
|  | PlaceGroup | Place an instance of a Model Group into the Autodesk Revit document, using a location and a group type.(Inherited from ItemFactoryBase) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The Document Creation object is a utility object that is used to create new instances of elements within the Autodesk Revit project. This object, available from the Document.Create property should be used to create elements instead of using New. This object ensures that the elements created are added to the document correctly.

#### Reference

Autodesk.Revit.Creation Namespace